name: "ResNet-2501"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "data/ilsvrc12_train_lmdb"
    batch_size: 32
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "data/ilsvrc12_val_lmdb"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_conv1"  
  type: "Scale"
  bottom: "conv1"
  top: "conv1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1_top"
  top: "conv1_top"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_top"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res_1_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res_1_branch1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_1_branch1"
  type: "BatchNorm"
  bottom: "res_1_branch1"
  top: "res_1_branch1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_1_branch1"  
  type: "Scale"
  bottom: "res_1_branch1"
  top: "res_1_branch1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_1_1"
  type: "Convolution"
  bottom: "pool1"
  top: "res_stage_1_1_1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_1_1"
  type: "BatchNorm"
  bottom: "res_stage_1_1_1"
  top: "res_stage_1_1_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_1_1"  
  type: "Scale"
  bottom: "res_stage_1_1_1"
  top: "res_stage_1_1_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_1_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_1_1_top"
  top: "res_stage_1_1_1_top"
}
layer {
  name: "res_stage_1_1_2"
  type: "Convolution"
  bottom: "res_stage_1_1_1_top"
  top: "res_stage_1_1_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_1_2"
  type: "BatchNorm"
  bottom: "res_stage_1_1_2"
  top: "res_stage_1_1_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_1_2"  
  type: "Scale"
  bottom: "res_stage_1_1_2"
  top: "res_stage_1_1_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_1_2_relu"
  type: "ReLU"
  bottom: "res_stage_1_1_2_top"
  top: "res_stage_1_1_2_top"
}
layer {
  name: "res_stage_1_1_3"
  type: "Convolution"
  bottom: "res_stage_1_1_2_top"
  top: "res_stage_1_1_3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_1_3"
  type: "BatchNorm"
  bottom: "res_stage_1_1_3"
  top: "res_stage_1_1_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_1_3"  
  type: "Scale"
  bottom: "res_stage_1_1_3"
  top: "res_stage_1_1_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_1_1"
  type: "Eltwise"
  bottom: "res_1_branch1_top"
  bottom: "res_stage_1_1_3_top"
  top: "res_1_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_1_relu"
  type: "ReLU"
  bottom: "res_1_1"
  top: "res_1_1"
}
layer {
  name: "res_stage_1_2_1"
  type: "Convolution"
  bottom: "res_1_1"
  top: "res_stage_1_2_1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_2_1"
  type: "BatchNorm"
  bottom: "res_stage_1_2_1"
  top: "res_stage_1_2_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_2_1"  
  type: "Scale"
  bottom: "res_stage_1_2_1"
  top: "res_stage_1_2_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_2_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_2_1_top"
  top: "res_stage_1_2_1_top"
}
layer {
  name: "res_stage_1_2_2"
  type: "Convolution"
  bottom: "res_stage_1_2_1_top"
  top: "res_stage_1_2_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_2_2"
  type: "BatchNorm"
  bottom: "res_stage_1_2_2"
  top: "res_stage_1_2_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_2_2"  
  type: "Scale"
  bottom: "res_stage_1_2_2"
  top: "res_stage_1_2_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_2_2_relu"
  type: "ReLU"
  bottom: "res_stage_1_2_2_top"
  top: "res_stage_1_2_2_top"
}
layer {
  name: "res_stage_1_2_3"
  type: "Convolution"
  bottom: "res_stage_1_2_2_top"
  top: "res_stage_1_2_3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_2_3"
  type: "BatchNorm"
  bottom: "res_stage_1_2_3"
  top: "res_stage_1_2_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_2_3"  
  type: "Scale"
  bottom: "res_stage_1_2_3"
  top: "res_stage_1_2_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_1_2"
  type: "Eltwise"
  bottom: "res_1_1"
  bottom: "res_stage_1_2_3_top"
  top: "res_1_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_2_relu"
  type: "ReLU"
  bottom: "res_1_2"
  top: "res_1_2"
}
layer {
  name: "res_stage_1_3_1"
  type: "Convolution"
  bottom: "res_1_2"
  top: "res_stage_1_3_1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_3_1"
  type: "BatchNorm"
  bottom: "res_stage_1_3_1"
  top: "res_stage_1_3_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_3_1"  
  type: "Scale"
  bottom: "res_stage_1_3_1"
  top: "res_stage_1_3_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_3_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_3_1_top"
  top: "res_stage_1_3_1_top"
}
layer {
  name: "res_stage_1_3_2"
  type: "Convolution"
  bottom: "res_stage_1_3_1_top"
  top: "res_stage_1_3_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_3_2"
  type: "BatchNorm"
  bottom: "res_stage_1_3_2"
  top: "res_stage_1_3_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_3_2"  
  type: "Scale"
  bottom: "res_stage_1_3_2"
  top: "res_stage_1_3_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_3_2_relu"
  type: "ReLU"
  bottom: "res_stage_1_3_2_top"
  top: "res_stage_1_3_2_top"
}
layer {
  name: "res_stage_1_3_3"
  type: "Convolution"
  bottom: "res_stage_1_3_2_top"
  top: "res_stage_1_3_3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_3_3"
  type: "BatchNorm"
  bottom: "res_stage_1_3_3"
  top: "res_stage_1_3_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_3_3"  
  type: "Scale"
  bottom: "res_stage_1_3_3"
  top: "res_stage_1_3_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_1_3"
  type: "Eltwise"
  bottom: "res_1_2"
  bottom: "res_stage_1_3_3_top"
  top: "res_1_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_3_relu"
  type: "ReLU"
  bottom: "res_1_3"
  top: "res_1_3"
}
layer {
  name: "res_stage_1_4_1"
  type: "Convolution"
  bottom: "res_1_3"
  top: "res_stage_1_4_1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_4_1"
  type: "BatchNorm"
  bottom: "res_stage_1_4_1"
  top: "res_stage_1_4_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_4_1"  
  type: "Scale"
  bottom: "res_stage_1_4_1"
  top: "res_stage_1_4_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_4_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_4_1_top"
  top: "res_stage_1_4_1_top"
}
layer {
  name: "res_stage_1_4_2"
  type: "Convolution"
  bottom: "res_stage_1_4_1_top"
  top: "res_stage_1_4_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_4_2"
  type: "BatchNorm"
  bottom: "res_stage_1_4_2"
  top: "res_stage_1_4_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_4_2"  
  type: "Scale"
  bottom: "res_stage_1_4_2"
  top: "res_stage_1_4_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_4_2_relu"
  type: "ReLU"
  bottom: "res_stage_1_4_2_top"
  top: "res_stage_1_4_2_top"
}
layer {
  name: "res_stage_1_4_3"
  type: "Convolution"
  bottom: "res_stage_1_4_2_top"
  top: "res_stage_1_4_3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_4_3"
  type: "BatchNorm"
  bottom: "res_stage_1_4_3"
  top: "res_stage_1_4_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_4_3"  
  type: "Scale"
  bottom: "res_stage_1_4_3"
  top: "res_stage_1_4_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_1_4"
  type: "Eltwise"
  bottom: "res_1_3"
  bottom: "res_stage_1_4_3_top"
  top: "res_1_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_4_relu"
  type: "ReLU"
  bottom: "res_1_4"
  top: "res_1_4"
}
layer {
  name: "res_stage_1_5_1"
  type: "Convolution"
  bottom: "res_1_4"
  top: "res_stage_1_5_1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_5_1"
  type: "BatchNorm"
  bottom: "res_stage_1_5_1"
  top: "res_stage_1_5_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_5_1"  
  type: "Scale"
  bottom: "res_stage_1_5_1"
  top: "res_stage_1_5_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_5_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_5_1_top"
  top: "res_stage_1_5_1_top"
}
layer {
  name: "res_stage_1_5_2"
  type: "Convolution"
  bottom: "res_stage_1_5_1_top"
  top: "res_stage_1_5_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_5_2"
  type: "BatchNorm"
  bottom: "res_stage_1_5_2"
  top: "res_stage_1_5_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_5_2"  
  type: "Scale"
  bottom: "res_stage_1_5_2"
  top: "res_stage_1_5_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_5_2_relu"
  type: "ReLU"
  bottom: "res_stage_1_5_2_top"
  top: "res_stage_1_5_2_top"
}
layer {
  name: "res_stage_1_5_3"
  type: "Convolution"
  bottom: "res_stage_1_5_2_top"
  top: "res_stage_1_5_3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_5_3"
  type: "BatchNorm"
  bottom: "res_stage_1_5_3"
  top: "res_stage_1_5_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_5_3"  
  type: "Scale"
  bottom: "res_stage_1_5_3"
  top: "res_stage_1_5_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_1_5"
  type: "Eltwise"
  bottom: "res_1_4"
  bottom: "res_stage_1_5_3_top"
  top: "res_1_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_5_relu"
  type: "ReLU"
  bottom: "res_1_5"
  top: "res_1_5"
}
layer {
  name: "res_stage_1_6_1"
  type: "Convolution"
  bottom: "res_1_5"
  top: "res_stage_1_6_1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_6_1"
  type: "BatchNorm"
  bottom: "res_stage_1_6_1"
  top: "res_stage_1_6_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_6_1"  
  type: "Scale"
  bottom: "res_stage_1_6_1"
  top: "res_stage_1_6_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_6_1_relu"
  type: "ReLU"
  bottom: "res_stage_1_6_1_top"
  top: "res_stage_1_6_1_top"
}
layer {
  name: "res_stage_1_6_2"
  type: "Convolution"
  bottom: "res_stage_1_6_1_top"
  top: "res_stage_1_6_2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_6_2"
  type: "BatchNorm"
  bottom: "res_stage_1_6_2"
  top: "res_stage_1_6_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_6_2"  
  type: "Scale"
  bottom: "res_stage_1_6_2"
  top: "res_stage_1_6_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_1_6_2_relu"
  type: "ReLU"
  bottom: "res_stage_1_6_2_top"
  top: "res_stage_1_6_2_top"
}
layer {
  name: "res_stage_1_6_3"
  type: "Convolution"
  bottom: "res_stage_1_6_2_top"
  top: "res_stage_1_6_3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_1_6_3"
  type: "BatchNorm"
  bottom: "res_stage_1_6_3"
  top: "res_stage_1_6_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_1_6_3"  
  type: "Scale"
  bottom: "res_stage_1_6_3"
  top: "res_stage_1_6_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_1_6"
  type: "Eltwise"
  bottom: "res_1_5"
  bottom: "res_stage_1_6_3_top"
  top: "res_1_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_1_6_relu"
  type: "ReLU"
  bottom: "res_1_6"
  top: "res_1_6"
}
layer {
  name: "res_2_branch1"
  type: "Convolution"
  bottom: "res_1_6"
  top: "res_2_branch1"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_2_branch1"
  type: "BatchNorm"
  bottom: "res_2_branch1"
  top: "res_2_branch1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_2_branch1"  
  type: "Scale"
  bottom: "res_2_branch1"
  top: "res_2_branch1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_1_1"
  type: "Convolution"
  bottom: "res_1_6"
  top: "res_stage_2_1_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_1_1"
  type: "BatchNorm"
  bottom: "res_stage_2_1_1"
  top: "res_stage_2_1_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_1_1"  
  type: "Scale"
  bottom: "res_stage_2_1_1"
  top: "res_stage_2_1_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_1_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_1_1_top"
  top: "res_stage_2_1_1_top"
}
layer {
  name: "res_stage_2_1_2"
  type: "Convolution"
  bottom: "res_stage_2_1_1_top"
  top: "res_stage_2_1_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_1_2"
  type: "BatchNorm"
  bottom: "res_stage_2_1_2"
  top: "res_stage_2_1_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_1_2"  
  type: "Scale"
  bottom: "res_stage_2_1_2"
  top: "res_stage_2_1_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_1_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_1_2_top"
  top: "res_stage_2_1_2_top"
}
layer {
  name: "res_stage_2_1_3"
  type: "Convolution"
  bottom: "res_stage_2_1_2_top"
  top: "res_stage_2_1_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_1_3"
  type: "BatchNorm"
  bottom: "res_stage_2_1_3"
  top: "res_stage_2_1_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_1_3"  
  type: "Scale"
  bottom: "res_stage_2_1_3"
  top: "res_stage_2_1_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_1"
  type: "Eltwise"
  bottom: "res_2_branch1_top"
  bottom: "res_stage_2_1_3_top"
  top: "res_2_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_1_relu"
  type: "ReLU"
  bottom: "res_2_1"
  top: "res_2_1"
}
layer {
  name: "res_stage_2_2_1"
  type: "Convolution"
  bottom: "res_2_1"
  top: "res_stage_2_2_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_2_1"
  type: "BatchNorm"
  bottom: "res_stage_2_2_1"
  top: "res_stage_2_2_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_2_1"  
  type: "Scale"
  bottom: "res_stage_2_2_1"
  top: "res_stage_2_2_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_2_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_2_1_top"
  top: "res_stage_2_2_1_top"
}
layer {
  name: "res_stage_2_2_2"
  type: "Convolution"
  bottom: "res_stage_2_2_1_top"
  top: "res_stage_2_2_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_2_2"
  type: "BatchNorm"
  bottom: "res_stage_2_2_2"
  top: "res_stage_2_2_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_2_2"  
  type: "Scale"
  bottom: "res_stage_2_2_2"
  top: "res_stage_2_2_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_2_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_2_2_top"
  top: "res_stage_2_2_2_top"
}
layer {
  name: "res_stage_2_2_3"
  type: "Convolution"
  bottom: "res_stage_2_2_2_top"
  top: "res_stage_2_2_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_2_3"
  type: "BatchNorm"
  bottom: "res_stage_2_2_3"
  top: "res_stage_2_2_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_2_3"  
  type: "Scale"
  bottom: "res_stage_2_2_3"
  top: "res_stage_2_2_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_2"
  type: "Eltwise"
  bottom: "res_2_1"
  bottom: "res_stage_2_2_3_top"
  top: "res_2_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_2_relu"
  type: "ReLU"
  bottom: "res_2_2"
  top: "res_2_2"
}
layer {
  name: "res_stage_2_3_1"
  type: "Convolution"
  bottom: "res_2_2"
  top: "res_stage_2_3_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_3_1"
  type: "BatchNorm"
  bottom: "res_stage_2_3_1"
  top: "res_stage_2_3_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_3_1"  
  type: "Scale"
  bottom: "res_stage_2_3_1"
  top: "res_stage_2_3_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_3_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_3_1_top"
  top: "res_stage_2_3_1_top"
}
layer {
  name: "res_stage_2_3_2"
  type: "Convolution"
  bottom: "res_stage_2_3_1_top"
  top: "res_stage_2_3_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_3_2"
  type: "BatchNorm"
  bottom: "res_stage_2_3_2"
  top: "res_stage_2_3_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_3_2"  
  type: "Scale"
  bottom: "res_stage_2_3_2"
  top: "res_stage_2_3_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_3_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_3_2_top"
  top: "res_stage_2_3_2_top"
}
layer {
  name: "res_stage_2_3_3"
  type: "Convolution"
  bottom: "res_stage_2_3_2_top"
  top: "res_stage_2_3_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_3_3"
  type: "BatchNorm"
  bottom: "res_stage_2_3_3"
  top: "res_stage_2_3_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_3_3"  
  type: "Scale"
  bottom: "res_stage_2_3_3"
  top: "res_stage_2_3_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_3"
  type: "Eltwise"
  bottom: "res_2_2"
  bottom: "res_stage_2_3_3_top"
  top: "res_2_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_3_relu"
  type: "ReLU"
  bottom: "res_2_3"
  top: "res_2_3"
}
layer {
  name: "res_stage_2_4_1"
  type: "Convolution"
  bottom: "res_2_3"
  top: "res_stage_2_4_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_4_1"
  type: "BatchNorm"
  bottom: "res_stage_2_4_1"
  top: "res_stage_2_4_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_4_1"  
  type: "Scale"
  bottom: "res_stage_2_4_1"
  top: "res_stage_2_4_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_4_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_4_1_top"
  top: "res_stage_2_4_1_top"
}
layer {
  name: "res_stage_2_4_2"
  type: "Convolution"
  bottom: "res_stage_2_4_1_top"
  top: "res_stage_2_4_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_4_2"
  type: "BatchNorm"
  bottom: "res_stage_2_4_2"
  top: "res_stage_2_4_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_4_2"  
  type: "Scale"
  bottom: "res_stage_2_4_2"
  top: "res_stage_2_4_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_4_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_4_2_top"
  top: "res_stage_2_4_2_top"
}
layer {
  name: "res_stage_2_4_3"
  type: "Convolution"
  bottom: "res_stage_2_4_2_top"
  top: "res_stage_2_4_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_4_3"
  type: "BatchNorm"
  bottom: "res_stage_2_4_3"
  top: "res_stage_2_4_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_4_3"  
  type: "Scale"
  bottom: "res_stage_2_4_3"
  top: "res_stage_2_4_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_4"
  type: "Eltwise"
  bottom: "res_2_3"
  bottom: "res_stage_2_4_3_top"
  top: "res_2_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_4_relu"
  type: "ReLU"
  bottom: "res_2_4"
  top: "res_2_4"
}
layer {
  name: "res_stage_2_5_1"
  type: "Convolution"
  bottom: "res_2_4"
  top: "res_stage_2_5_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_5_1"
  type: "BatchNorm"
  bottom: "res_stage_2_5_1"
  top: "res_stage_2_5_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_5_1"  
  type: "Scale"
  bottom: "res_stage_2_5_1"
  top: "res_stage_2_5_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_5_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_5_1_top"
  top: "res_stage_2_5_1_top"
}
layer {
  name: "res_stage_2_5_2"
  type: "Convolution"
  bottom: "res_stage_2_5_1_top"
  top: "res_stage_2_5_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_5_2"
  type: "BatchNorm"
  bottom: "res_stage_2_5_2"
  top: "res_stage_2_5_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_5_2"  
  type: "Scale"
  bottom: "res_stage_2_5_2"
  top: "res_stage_2_5_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_5_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_5_2_top"
  top: "res_stage_2_5_2_top"
}
layer {
  name: "res_stage_2_5_3"
  type: "Convolution"
  bottom: "res_stage_2_5_2_top"
  top: "res_stage_2_5_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_5_3"
  type: "BatchNorm"
  bottom: "res_stage_2_5_3"
  top: "res_stage_2_5_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_5_3"  
  type: "Scale"
  bottom: "res_stage_2_5_3"
  top: "res_stage_2_5_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_5"
  type: "Eltwise"
  bottom: "res_2_4"
  bottom: "res_stage_2_5_3_top"
  top: "res_2_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_5_relu"
  type: "ReLU"
  bottom: "res_2_5"
  top: "res_2_5"
}
layer {
  name: "res_stage_2_6_1"
  type: "Convolution"
  bottom: "res_2_5"
  top: "res_stage_2_6_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_6_1"
  type: "BatchNorm"
  bottom: "res_stage_2_6_1"
  top: "res_stage_2_6_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_6_1"  
  type: "Scale"
  bottom: "res_stage_2_6_1"
  top: "res_stage_2_6_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_6_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_6_1_top"
  top: "res_stage_2_6_1_top"
}
layer {
  name: "res_stage_2_6_2"
  type: "Convolution"
  bottom: "res_stage_2_6_1_top"
  top: "res_stage_2_6_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_6_2"
  type: "BatchNorm"
  bottom: "res_stage_2_6_2"
  top: "res_stage_2_6_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_6_2"  
  type: "Scale"
  bottom: "res_stage_2_6_2"
  top: "res_stage_2_6_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_6_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_6_2_top"
  top: "res_stage_2_6_2_top"
}
layer {
  name: "res_stage_2_6_3"
  type: "Convolution"
  bottom: "res_stage_2_6_2_top"
  top: "res_stage_2_6_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_6_3"
  type: "BatchNorm"
  bottom: "res_stage_2_6_3"
  top: "res_stage_2_6_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_6_3"  
  type: "Scale"
  bottom: "res_stage_2_6_3"
  top: "res_stage_2_6_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_6"
  type: "Eltwise"
  bottom: "res_2_5"
  bottom: "res_stage_2_6_3_top"
  top: "res_2_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_6_relu"
  type: "ReLU"
  bottom: "res_2_6"
  top: "res_2_6"
}
layer {
  name: "res_stage_2_7_1"
  type: "Convolution"
  bottom: "res_2_6"
  top: "res_stage_2_7_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_7_1"
  type: "BatchNorm"
  bottom: "res_stage_2_7_1"
  top: "res_stage_2_7_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_7_1"  
  type: "Scale"
  bottom: "res_stage_2_7_1"
  top: "res_stage_2_7_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_7_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_7_1_top"
  top: "res_stage_2_7_1_top"
}
layer {
  name: "res_stage_2_7_2"
  type: "Convolution"
  bottom: "res_stage_2_7_1_top"
  top: "res_stage_2_7_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_7_2"
  type: "BatchNorm"
  bottom: "res_stage_2_7_2"
  top: "res_stage_2_7_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_7_2"  
  type: "Scale"
  bottom: "res_stage_2_7_2"
  top: "res_stage_2_7_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_7_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_7_2_top"
  top: "res_stage_2_7_2_top"
}
layer {
  name: "res_stage_2_7_3"
  type: "Convolution"
  bottom: "res_stage_2_7_2_top"
  top: "res_stage_2_7_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_7_3"
  type: "BatchNorm"
  bottom: "res_stage_2_7_3"
  top: "res_stage_2_7_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_7_3"  
  type: "Scale"
  bottom: "res_stage_2_7_3"
  top: "res_stage_2_7_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_7"
  type: "Eltwise"
  bottom: "res_2_6"
  bottom: "res_stage_2_7_3_top"
  top: "res_2_7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_7_relu"
  type: "ReLU"
  bottom: "res_2_7"
  top: "res_2_7"
}
layer {
  name: "res_stage_2_8_1"
  type: "Convolution"
  bottom: "res_2_7"
  top: "res_stage_2_8_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_8_1"
  type: "BatchNorm"
  bottom: "res_stage_2_8_1"
  top: "res_stage_2_8_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_8_1"  
  type: "Scale"
  bottom: "res_stage_2_8_1"
  top: "res_stage_2_8_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_8_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_8_1_top"
  top: "res_stage_2_8_1_top"
}
layer {
  name: "res_stage_2_8_2"
  type: "Convolution"
  bottom: "res_stage_2_8_1_top"
  top: "res_stage_2_8_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_8_2"
  type: "BatchNorm"
  bottom: "res_stage_2_8_2"
  top: "res_stage_2_8_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_8_2"  
  type: "Scale"
  bottom: "res_stage_2_8_2"
  top: "res_stage_2_8_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_8_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_8_2_top"
  top: "res_stage_2_8_2_top"
}
layer {
  name: "res_stage_2_8_3"
  type: "Convolution"
  bottom: "res_stage_2_8_2_top"
  top: "res_stage_2_8_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_8_3"
  type: "BatchNorm"
  bottom: "res_stage_2_8_3"
  top: "res_stage_2_8_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_8_3"  
  type: "Scale"
  bottom: "res_stage_2_8_3"
  top: "res_stage_2_8_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_8"
  type: "Eltwise"
  bottom: "res_2_7"
  bottom: "res_stage_2_8_3_top"
  top: "res_2_8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_8_relu"
  type: "ReLU"
  bottom: "res_2_8"
  top: "res_2_8"
}
layer {
  name: "res_stage_2_9_1"
  type: "Convolution"
  bottom: "res_2_8"
  top: "res_stage_2_9_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_9_1"
  type: "BatchNorm"
  bottom: "res_stage_2_9_1"
  top: "res_stage_2_9_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_9_1"  
  type: "Scale"
  bottom: "res_stage_2_9_1"
  top: "res_stage_2_9_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_9_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_9_1_top"
  top: "res_stage_2_9_1_top"
}
layer {
  name: "res_stage_2_9_2"
  type: "Convolution"
  bottom: "res_stage_2_9_1_top"
  top: "res_stage_2_9_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_9_2"
  type: "BatchNorm"
  bottom: "res_stage_2_9_2"
  top: "res_stage_2_9_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_9_2"  
  type: "Scale"
  bottom: "res_stage_2_9_2"
  top: "res_stage_2_9_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_9_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_9_2_top"
  top: "res_stage_2_9_2_top"
}
layer {
  name: "res_stage_2_9_3"
  type: "Convolution"
  bottom: "res_stage_2_9_2_top"
  top: "res_stage_2_9_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_9_3"
  type: "BatchNorm"
  bottom: "res_stage_2_9_3"
  top: "res_stage_2_9_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_9_3"  
  type: "Scale"
  bottom: "res_stage_2_9_3"
  top: "res_stage_2_9_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_9"
  type: "Eltwise"
  bottom: "res_2_8"
  bottom: "res_stage_2_9_3_top"
  top: "res_2_9"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_9_relu"
  type: "ReLU"
  bottom: "res_2_9"
  top: "res_2_9"
}
layer {
  name: "res_stage_2_10_1"
  type: "Convolution"
  bottom: "res_2_9"
  top: "res_stage_2_10_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_10_1"
  type: "BatchNorm"
  bottom: "res_stage_2_10_1"
  top: "res_stage_2_10_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_10_1"  
  type: "Scale"
  bottom: "res_stage_2_10_1"
  top: "res_stage_2_10_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_10_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_10_1_top"
  top: "res_stage_2_10_1_top"
}
layer {
  name: "res_stage_2_10_2"
  type: "Convolution"
  bottom: "res_stage_2_10_1_top"
  top: "res_stage_2_10_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_10_2"
  type: "BatchNorm"
  bottom: "res_stage_2_10_2"
  top: "res_stage_2_10_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_10_2"  
  type: "Scale"
  bottom: "res_stage_2_10_2"
  top: "res_stage_2_10_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_10_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_10_2_top"
  top: "res_stage_2_10_2_top"
}
layer {
  name: "res_stage_2_10_3"
  type: "Convolution"
  bottom: "res_stage_2_10_2_top"
  top: "res_stage_2_10_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_10_3"
  type: "BatchNorm"
  bottom: "res_stage_2_10_3"
  top: "res_stage_2_10_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_10_3"  
  type: "Scale"
  bottom: "res_stage_2_10_3"
  top: "res_stage_2_10_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_10"
  type: "Eltwise"
  bottom: "res_2_9"
  bottom: "res_stage_2_10_3_top"
  top: "res_2_10"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_10_relu"
  type: "ReLU"
  bottom: "res_2_10"
  top: "res_2_10"
}
layer {
  name: "res_stage_2_11_1"
  type: "Convolution"
  bottom: "res_2_10"
  top: "res_stage_2_11_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_11_1"
  type: "BatchNorm"
  bottom: "res_stage_2_11_1"
  top: "res_stage_2_11_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_11_1"  
  type: "Scale"
  bottom: "res_stage_2_11_1"
  top: "res_stage_2_11_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_11_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_11_1_top"
  top: "res_stage_2_11_1_top"
}
layer {
  name: "res_stage_2_11_2"
  type: "Convolution"
  bottom: "res_stage_2_11_1_top"
  top: "res_stage_2_11_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_11_2"
  type: "BatchNorm"
  bottom: "res_stage_2_11_2"
  top: "res_stage_2_11_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_11_2"  
  type: "Scale"
  bottom: "res_stage_2_11_2"
  top: "res_stage_2_11_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_11_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_11_2_top"
  top: "res_stage_2_11_2_top"
}
layer {
  name: "res_stage_2_11_3"
  type: "Convolution"
  bottom: "res_stage_2_11_2_top"
  top: "res_stage_2_11_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_11_3"
  type: "BatchNorm"
  bottom: "res_stage_2_11_3"
  top: "res_stage_2_11_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_11_3"  
  type: "Scale"
  bottom: "res_stage_2_11_3"
  top: "res_stage_2_11_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_11"
  type: "Eltwise"
  bottom: "res_2_10"
  bottom: "res_stage_2_11_3_top"
  top: "res_2_11"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_11_relu"
  type: "ReLU"
  bottom: "res_2_11"
  top: "res_2_11"
}
layer {
  name: "res_stage_2_12_1"
  type: "Convolution"
  bottom: "res_2_11"
  top: "res_stage_2_12_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_12_1"
  type: "BatchNorm"
  bottom: "res_stage_2_12_1"
  top: "res_stage_2_12_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_12_1"  
  type: "Scale"
  bottom: "res_stage_2_12_1"
  top: "res_stage_2_12_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_12_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_12_1_top"
  top: "res_stage_2_12_1_top"
}
layer {
  name: "res_stage_2_12_2"
  type: "Convolution"
  bottom: "res_stage_2_12_1_top"
  top: "res_stage_2_12_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_12_2"
  type: "BatchNorm"
  bottom: "res_stage_2_12_2"
  top: "res_stage_2_12_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_12_2"  
  type: "Scale"
  bottom: "res_stage_2_12_2"
  top: "res_stage_2_12_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_12_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_12_2_top"
  top: "res_stage_2_12_2_top"
}
layer {
  name: "res_stage_2_12_3"
  type: "Convolution"
  bottom: "res_stage_2_12_2_top"
  top: "res_stage_2_12_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_12_3"
  type: "BatchNorm"
  bottom: "res_stage_2_12_3"
  top: "res_stage_2_12_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_12_3"  
  type: "Scale"
  bottom: "res_stage_2_12_3"
  top: "res_stage_2_12_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_12"
  type: "Eltwise"
  bottom: "res_2_11"
  bottom: "res_stage_2_12_3_top"
  top: "res_2_12"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_12_relu"
  type: "ReLU"
  bottom: "res_2_12"
  top: "res_2_12"
}
layer {
  name: "res_stage_2_13_1"
  type: "Convolution"
  bottom: "res_2_12"
  top: "res_stage_2_13_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_13_1"
  type: "BatchNorm"
  bottom: "res_stage_2_13_1"
  top: "res_stage_2_13_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_13_1"  
  type: "Scale"
  bottom: "res_stage_2_13_1"
  top: "res_stage_2_13_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_13_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_13_1_top"
  top: "res_stage_2_13_1_top"
}
layer {
  name: "res_stage_2_13_2"
  type: "Convolution"
  bottom: "res_stage_2_13_1_top"
  top: "res_stage_2_13_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_13_2"
  type: "BatchNorm"
  bottom: "res_stage_2_13_2"
  top: "res_stage_2_13_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_13_2"  
  type: "Scale"
  bottom: "res_stage_2_13_2"
  top: "res_stage_2_13_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_13_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_13_2_top"
  top: "res_stage_2_13_2_top"
}
layer {
  name: "res_stage_2_13_3"
  type: "Convolution"
  bottom: "res_stage_2_13_2_top"
  top: "res_stage_2_13_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_13_3"
  type: "BatchNorm"
  bottom: "res_stage_2_13_3"
  top: "res_stage_2_13_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_13_3"  
  type: "Scale"
  bottom: "res_stage_2_13_3"
  top: "res_stage_2_13_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_13"
  type: "Eltwise"
  bottom: "res_2_12"
  bottom: "res_stage_2_13_3_top"
  top: "res_2_13"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_13_relu"
  type: "ReLU"
  bottom: "res_2_13"
  top: "res_2_13"
}
layer {
  name: "res_stage_2_14_1"
  type: "Convolution"
  bottom: "res_2_13"
  top: "res_stage_2_14_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_14_1"
  type: "BatchNorm"
  bottom: "res_stage_2_14_1"
  top: "res_stage_2_14_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_14_1"  
  type: "Scale"
  bottom: "res_stage_2_14_1"
  top: "res_stage_2_14_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_14_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_14_1_top"
  top: "res_stage_2_14_1_top"
}
layer {
  name: "res_stage_2_14_2"
  type: "Convolution"
  bottom: "res_stage_2_14_1_top"
  top: "res_stage_2_14_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_14_2"
  type: "BatchNorm"
  bottom: "res_stage_2_14_2"
  top: "res_stage_2_14_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_14_2"  
  type: "Scale"
  bottom: "res_stage_2_14_2"
  top: "res_stage_2_14_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_14_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_14_2_top"
  top: "res_stage_2_14_2_top"
}
layer {
  name: "res_stage_2_14_3"
  type: "Convolution"
  bottom: "res_stage_2_14_2_top"
  top: "res_stage_2_14_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_14_3"
  type: "BatchNorm"
  bottom: "res_stage_2_14_3"
  top: "res_stage_2_14_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_14_3"  
  type: "Scale"
  bottom: "res_stage_2_14_3"
  top: "res_stage_2_14_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_14"
  type: "Eltwise"
  bottom: "res_2_13"
  bottom: "res_stage_2_14_3_top"
  top: "res_2_14"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_14_relu"
  type: "ReLU"
  bottom: "res_2_14"
  top: "res_2_14"
}
layer {
  name: "res_stage_2_15_1"
  type: "Convolution"
  bottom: "res_2_14"
  top: "res_stage_2_15_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_15_1"
  type: "BatchNorm"
  bottom: "res_stage_2_15_1"
  top: "res_stage_2_15_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_15_1"  
  type: "Scale"
  bottom: "res_stage_2_15_1"
  top: "res_stage_2_15_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_15_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_15_1_top"
  top: "res_stage_2_15_1_top"
}
layer {
  name: "res_stage_2_15_2"
  type: "Convolution"
  bottom: "res_stage_2_15_1_top"
  top: "res_stage_2_15_2"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_15_2"
  type: "BatchNorm"
  bottom: "res_stage_2_15_2"
  top: "res_stage_2_15_2"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_15_2"  
  type: "Scale"
  bottom: "res_stage_2_15_2"
  top: "res_stage_2_15_2_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_15_2_relu"
  type: "ReLU"
  bottom: "res_stage_2_15_2_top"
  top: "res_stage_2_15_2_top"
}
layer {
  name: "res_stage_2_15_3"
  type: "Convolution"
  bottom: "res_stage_2_15_2_top"
  top: "res_stage_2_15_3"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_15_3"
  type: "BatchNorm"
  bottom: "res_stage_2_15_3"
  top: "res_stage_2_15_3"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_15_3"  
  type: "Scale"
  bottom: "res_stage_2_15_3"
  top: "res_stage_2_15_3_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_2_15"
  type: "Eltwise"
  bottom: "res_2_14"
  bottom: "res_stage_2_15_3_top"
  top: "res_2_15"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res_2_15_relu"
  type: "ReLU"
  bottom: "res_2_15"
  top: "res_2_15"
}
layer {
  name: "res_stage_2_16_1"
  type: "Convolution"
  bottom: "res_2_15"
  top: "res_stage_2_16_1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "bn_stage_2_16_1"
  type: "BatchNorm"
  bottom: "res_stage_2_16_1"
  top: "res_stage_2_16_1"
  batch_norm_param {
      use_global_stats: false
  }
}
layer {
  name: "scale_stage_2_16_1"  
  type: "Scale"
  bottom: "res_stage_2_16_1"
  top: "res_stage_2_16_1_top"
  scale_param {
	bias_term: true
  }
}
 layer {
  name: "res_stage_2_16_1_relu"
  type: "ReLU"
  bottom: "res_stage_2_16_1_top"
